## Importing Libraries

In [1]:
import pandas as pd
import numpy as np
import os

## Importing Data

In [2]:
# Folder Path

path = r'C:\Users\Windows 10\Documents\04-2023 Instacart Basket Analysis'

In [3]:
path

'C:\\Users\\Windows 10\\Documents\\04-2023 Instacart Basket Analysis'

In [4]:
# Import orders_products_combined.pkl

df_orders_products_combined = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_combined.pkl'))

In [5]:
# Import products_checked.csv

df_prods = pd.read_csv(os.path.join(path, '02 Data', 'Prepared Data', 'products_checked.csv'), index_col = False)

## Exercise 4.6 (Steps 4-7)

### Step 4: Check the shape

#### df_orders_products_combined

In [6]:
# Check the shape of the df_orders_products_combined

df_orders_products_combined.shape

(32434489, 11)

In [7]:
# Check output of the df_orders_products_combined

df_orders_products_combined.head()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,0,2539329,1,1,2,8,NaN,196,1,0,both
1,0,2539329,1,1,2,8,NaN,14084,2,0,both
2,0,2539329,1,1,2,8,NaN,12427,3,0,both
3,0,2539329,1,1,2,8,NaN,26088,4,0,both
4,0,2539329,1,1,2,8,NaN,26405,5,0,both

In [8]:
# Drop "Unnamed: 0" column from df_orders_products_combined

df_orders_products_combined = df_orders_products_combined.drop(columns = ['Unnamed: 0'])

In [9]:
# Re-check the shape after deleting the "Unnamed: 0" column

df_orders_products_combined.shape

(32434489, 10)

In [10]:
# Re-check the output after deleting the "Unnamed: 0" column

df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,_merge
0,2539329,1,1,2,8,NaN,196,1,0,both
1,2539329,1,1,2,8,NaN,14084,2,0,both
2,2539329,1,1,2,8,NaN,12427,3,0,both
3,2539329,1,1,2,8,NaN,26088,4,0,both
4,2539329,1,1,2,8,NaN,26405,5,0,both

#### df_prods

In [11]:
# Check the shape of the df_prods

df_prods.shape

(49672, 6)

In [12]:
# Check the output of the df_prods

df_prods.head()

,Unnamed: 0,product_id,product_name,aisle_id,department_id,prices
0,0,1,Chocolate Sandwich Cookies,61,19,5.8
1,1,2,All-Seasons Salt,104,13,9.3
2,2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,4,5,Green Chile Anytime Sauce,5,13,4.3

In [13]:
# Drop "Unnamed: 0" column from df_prods

df_prods = df_prods.drop(columns = ['Unnamed: 0'])

In [14]:
# Re-check the shape after deleting the "Unnamed: 0" column

df_prods.shape

(49672, 5)

In [15]:
# Re-check the output after deleting the "Unnamed: 0" column

df_prods.head()

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3

### Step 5: Merge df_orders_products_combined with df_prods

In [17]:
# Before I merge the two dataframes I want to drop the "_merge" column in the df_orders_products_combined

df_orders_products_combined = df_orders_products_combined.drop(columns = ['_merge'])

In [18]:
# Re-check the shape after deleting the "_merge" column

df_orders_products_combined.shape

(32434489, 9)

In [19]:
# Re-check the output after deleting the "_merge" column

df_orders_products_combined.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered
0,2539329,1,1,2,8,NaN,196,1,0
1,2539329,1,1,2,8,NaN,14084,2,0
2,2539329,1,1,2,8,NaN,12427,3,0
3,2539329,1,1,2,8,NaN,26088,4,0
4,2539329,1,1,2,8,NaN,26405,5,0

#### Merge df_orders_products_combined with df_prods (with the help of "product_id")

In [20]:
df_merged = df_orders_products_combined.merge(df_prods, on = 'product_id', indicator = True)

In [21]:
# Check the output of the df_merged

df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,product_name,aisle_id,department_id,prices,_merge
0,2539329,1,1,2,8,NaN,196,1,0,Soda,77,7,9.0,both
1,2398795,1,2,3,7,15.0,196,1,1,Soda,77,7,9.0,both
2,473747,1,3,3,12,21.0,196,1,1,Soda,77,7,9.0,both
3,2254736,1,4,4,7,29.0,196,1,1,Soda,77,7,9.0,both
4,431534,1,5,4,15,28.0,196,1,1,Soda,77,7,9.0,both

### Step 6: Confirm the results of the merge using the merge flag

In [22]:
# Check value counts for '_merge' column

df_merged['_merge'].value_counts()

both          32404859
left_only            0
right_only           0
Name: _merge, dtype: int64

In [23]:
# Check the shape of the df_prods

df_merged.shape

(32404859, 14)

### Step 7: Export the newly created dataframe as orders_products_merged

In [24]:
# Export df_merged as .pkl

df_merged.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_merged.pkl'))